; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	TJL73 <tjl73@x-privat.org>
; Homepage:	http://tjl73.altervista.org/
; Some corrections by bovirus (@2010.24.13)
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode (UTF-8) format and Zip it to preserve formatting
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&OK"
CANCEL_BUT = "&Annulla"
MAIN_DEST_DIR_LABEL = "Cartella di &destinazione:"
MAIN_FILE_LABEL = "&Archivio/Installer da estrarre:"
MENU_FILE_LABEL = "&File"
MENU_FILE_QUIT_LABEL = "&Esci"
MENU_EDIT_LABEL = "&Modifica"
MENU_EDIT_PREFS_LABEL = "&Preferenze"
MENU_HELP_LABEL = "A&iuto"
MENU_HELP_WEB_LABEL = "Sito &Web di %s"
PREFS_TITLE_LABEL = "Preferenze"
PREFS_UNIEXTRACT_OPTS_LABEL = "Opzioni di Universal Extractor"
PREFS_HISTORY_LABEL = "Tieni traccia della &cronologia"
PREFS_FORMAT_OPTS_LABEL = "Opzioni specifiche del formato"
PREFS_LANG_LABEL = "&Lingua"
PREFS_DEBUG_LABEL = "Cartella per il file di &debug:"
PREFS_WARN_EXECUTE_LABEL = "A&vverti prima di eseguire un file"
PREFS_REMOVE_DUPE_LABEL = "&Rimuovi i file duplicati"
PREFS_REMOVE_TEMP_LABEL = "Rimuovi i file &temporanei"
PREFS_APPEND_EXT_LABEL = "&Aggiungi le estensioni mancanti"
METHOD_ADMIN_RADIO = "Installer amministrativo %s"
METHOD_EXTRACTION_RADIO = "Estrazione %s"
METHOD_HEADER = "Estrazione di %s"
METHOD_MSI_NOTE_LABEL = "Nota:"
METHOD_MSI_REQUIRES_LABEL = "msi2xml richiede il"
METHOD_MSI_URL_LABEL = "Parser MSXML 4.0"
METHOD_RADIO_LABEL = "Metodo estrazione"
METHOD_SWITCH_RADIO = "%s"
METHOD_NOTIS_RADIO = "Non è un installer InstallShield"
METHOD_TEXT_LABEL = "%s supporta i seguenti metodi per estrarre gli archivi di tipo %s.  Sfortunatamente, nessuno di questi metodi è affidabile al 100%.  Se il metodo selezionato non funziona, riavviare %s e selezionare un metodo alternativo."
METHOD_UNPACKER_RADIO = "Decompressore %s"

; GUI control functions
DOES_NOT_EXIST = "non esiste.%n"
EXTRACT_TO = "Estrarre in:"
INVALID_DIR_SELECTED =  "%s non è una cartella valida."
INVALID_FILE_SELECTED = "%sSelezionare un file valido."
OPEN_FILE = "Apri file"
SELECT_FILE = "Seleziona file"
WRITE_TO = "Scrivi in:"

; Common terms
TERM_ARCHIVE = "archivio"
TERM_COMPRESSED = "file compresso"
TERM_DISK = "disco"
TERM_EBOOK = "eBook"
TERM_ECARD = "eCard"
TERM_ENCODED = "file codificato"
TERM_EXECUTABLE = "eseguibile"
TERM_FAILED = "fallito"
TERM_HELP = "file della guida"
TERM_HOTFIX = "hotfix"
TERM_IMAGE = "immagine"
TERM_INSTALLER = "installazione"
TERM_PACKAGE = "package"
TERM_PATCH = "patch"
TERM_SFX = "autoestraente"
TERM_STAGE = "livello"
TERM_SUCCEEDED = "con successo"
TERM_TESTING = "Test"
TERM_UNKNOWN = "sconosciuto"
TERM_UNPACKED = "non compresso"
TERM_UPDATER = "aggiornamento"

; Status messages
SCANNING_FILE = "Scansione del file per determinarne il tipo."
SCANNING_EXE = "Scansione del file con lo scanner %s."
EXTRACTING = "Estrazione file da:"
INIT_WAIT = "In attesa dell'inizializzazione dell'installer.%nAttendere, prego."

; Custom prompts
CONVERT_CDROM = "L'immagine CD-ROM %s non può essere estratta automaticamente.  Quindi, questa imagine%nsarà convertita in un'immagine CD-ROM ISO, che potrà essere estratta.%n%nVuoi continuare?%nNota: Questo processo richiederà alcuni minuti."
CONVERT_CDROM_STAGE1_FAILED = "Errore: L'immagine CD-ROM non può essere convertita.%nSe è presente un'immagine BIN/CUE, assicurarsi che il file CUE sia nel formato corretto."
CONVERT_CDROM_STAGE2_FAILED = "Errore: Un'immagine ISO è stata creata dall'immagine %s, ma non può essere convertita.%nVuoi preservare l'immagine ISO per ulteriori analisi?"
CONVERT_BIN_MISSING = "Errore: Impossibile trovare:%n%s\%s.%s%n%nEntrambi i file %s.bin e %s.cue sono necessari."
INIT_COMPLETE = "Inizializzazione %s.  Uscire dall'installer e premere OK per continuare."
WISE_MSI_PROMPT = "Attenzione: Questo metodo funziona solo con alcuni pacchetti Wise Installer per Windows.%nSe il wizard di Wise Installer si avvia e resta in attesa di istruzioni, questo file non è supportato.%nUscire dall'installer e %s interromperà l'estrazione.%n%nVuoi continuare?"
UNPACK_PROMPT = "Questo file è archiviato con la compressione %s, ma può essere estratto.%nCiò a causa del tipo di file non supportato o poiché non c'è nulla all'interno da estrarre.%n%nVuoi provare a scompattare questo file?%n%nNota: Il file scompattato verrà chiamato:%n%s\%s_unpacked.%s"
UNPACK_FAILED = "Errore: %s%nnon può essere scompattato."
WARN_EXECUTE = "Attenzione:  Per poter estrarre questo tipo di file, questi deve essere eseguito direttamente.%nSe continui, verrà eseguito il seguente comando:%n%n%s%n%nSe si suppone che il file possa contenere del codice malevolo, è sconsigliato proseguire.%nVuoi continuare con l'estrazione?"

; Help text
HELP_SUMMARY = "Estrae file da qualsiasi tipo di archivio o pacchetto di installazione."
HELP_SYNTAX = "%nUtilizzo:  %s [/help] [nomefile [destinazione]]"
HELP_ARGUMENTS = "%n%nOpzioni supportate:"
HELP_HELP = "%n     /help%t%tMostra le informazioni della guida"
HELP_PREFS = "%n     /prefs%t%tOttimizza le preferenze di UniExtract"
HELP_FILENAME = "%n     nomefile%tNome del file da estrarre"
HELP_DESTINATION = "%n     destinazione%tCartella in cui estrarre"
HELP_SUB = "%n%nDando /sub invece di una cartella di destinazione, impone%n%s di estrarre l'archivio in una sottocartella."
HELP_EXAMPLE1 = "%n%nEsempio:"
HELP_EXAMPLE2 = "%n     %s c:\1\esempio.zip c:\prova"
HELP_NOARGS = "%n%nAvviando %s senza opzioni, verrà%nrichiesto all'utente il nome del file e la cartella di destinazione."

; Error messages
CANNOT_LOG = "%s le estrazioni non possono essere registrate."
CANNOT_DEBUG = "La cartella di output del file di debug, "%s", è in sola lettura.%nVerrà quindi utilizzata la cartella temporanea di sistema."
CANNOT_EXTRACT = "%s non può essere estratto.%nIl tipo di file rilevato è: %s%n%nClicca su OK se vuoi analizzare il file autonomamente, oppure su Annulla per terminare."
UNKNOWN_EXT = "%s%nha un'estensione sconosciuta e non può essere estratto."
INVALID_DIR = "%s%nnon può essere creato.  Inserire una destinazione valida."
EXTRACT_FAILED = "%s non può essere estratto.%nSembra essere un %s, che è supportato, ma l'estrazione è fallita.%nPer maggiori informazioni, verificare il file di log: "%s".%n%nClicca su OK per visualizzare il file ora, oppure su Annulla per terminare."

[Installer]
; Components page
COMP_DOCS = "Informazioni sulla documentazione e le licenze"
COMP_LANG = "File di lingua per il supporto della localizzazione"
COMP_ACE = "Supporto per i file ACE"
COMP_KGB = "Supporto per i file KGB"
COMP_PEA = "Supporto per i file Pea"
COMP_SIT = "Supporto per i file StuffIt"

; Preferences page
PREFS_CAPTION = "Opzioni del programma"
PREFS_DESCRIPTION = "Quali opzioni di Universal Extractor vuoi impostare?"
PREFS_LABEL1 = "Puoi impostare le seguenti opzioni per definire il comportamento predefinito di Universal Extractor."
PREFS_LABEL2 = "Queste opzioni possono essere variate dopo l'installazione, modificando il file UniExtract.ini."
LANGUAGE_LABEL = "Lingua predefinita"
DEBUG_LABEL = "Posizione del file di debug"
APPEND_EXT_LABEL = "&Aggiungi le estensioni mancanti ai file"
HISTORY_LABEL = "&Conserva la cronologia degli archivi"
REMOVE_DUPE_LABEL = "Rimuovi i file &duplicati"
REMOVE_TEMP_LABEL = "Rimuovi i file &temporanei"
WARN_EXECUTE_LABEL = "A&vverti prima di eseguire i file"

; Tasks page
ASSOCIATE = "Abilita l'&integrazione nei menu contestuali della Shell di sistema"
ASSOCIATE_FILES = "Aggiungi la voce 'Estrai con UniExtract i &file...' al menu contestuale"
ASSOCIATE_HERE = "Aggiungi la voce 'Estrai con UniExtract &qui' al menu contestuale"
ASSOCIATE_SUBDIR = "Aggiungi la voce 'Estrai con UniExtract nella &sottocartella' al menu contestuale"
ASSOCIATE_FORCE = "Forza l'&associazione delle estensioni di tutti i formati supportati"
MODIFY_PATH = "Aggiungi Universal Extractor al tuo &Path di sistema"
DESKTOP_ICON = "Crea un'icona sul &Desktop"
QUICK_LAUNCH_ICON = "Crea un'icona in Avvio &veloce"
SENDTO_ICON = "Crea un'icona in &Invia a"

; Context Menu integration
EXTRACT_FILES = "Estrai con UniExtract i &file..."
EXTRACT_HERE = "Estrai con UniExtract &qui"
EXTRACT_SUB = "Estrai con UniExtract nella &sottocartella"
